Repository: BorisE/IP9212driver
Catalog: IP9212_switch2/SetupDialogForm.*.resx
Languages: ru

# cmdCancel.Text
source: Cancel
ru: Отмена

# label9.Text
source: Language
ru: Язык

# label7.Text
source: Caching switch data for
ru: Кэширования значений датчиков

# label1.Text
source: Caching check connections for
ru: Кэширование наличия соедиения

# txtCacheRead.ToolTip
source: Cache timeout in seconds for reading switch values. Default 4 sec. This value is used to cache "GetValue" result. Many times programs query all 16 switches one by one. So a little caching which will read all values in a row would be useful. Do not recomended to set too high values.
ru: Кэшировать результаты чтения состояния устройства в течение заданного интервала. По умолчанию 4 сек. Для отключения введите 0 сек. Смысл в том, что чаще всего программы запрашивают через драйвер состояние портов один за одним, что опять же создает ненужную нагрузку на устройство. При ненулевом значении, драйвер сначала прочитает значения всех портов за одно обращение и в течение заданного интвервала будет использовать эти значения без обращения к устройству. Как и в случае предудыщей опции, какое-то небольшое значение рекомендуется все таки указывать. Но слишком большое может привести в некоторых случаях к неточному определению состояния портов (рекомендуется 2..4 сек)

# txtCacheConnect.ToolTip
source: Cache timeout in seconds. Default 20 sec. This value is used to cache "is connected" result. Some programs query driver up to every second is it still alive. With high network query intensivity the device can hang. So the driver is using "smart" caching technique (when it is safe to use cached value)
ru: Кэшировать результаты проверки наличия соединения с устройством в течение заданного интервала. По умолчанию 20 сек. Для отключения введите 0 сек. Некоторые программы проверяют наличие соединение с устройством каждую секунду, что вызывает абсолютно ненужную нагрузку на устройство. Причем в некоторых случаях, это даже приводит к зависанию устройства. Поэтому какое-то небольшое значение рекомендуется все таки указывать.

# chkTrace.Text
source: Trace on
ru: Лог отладки

# chkTrace.ToolTip
source: Driver will write ASCOM logs. Usefull for debugging problems
ru: Запись логов в формате ASCOM (обычно в Documents\ASCOM\Logs yyyy-mm-dd). Нужно для отладки, в нормальном режиме работы стоит отключить.

# groupBox3.Text
source: Advanced
ru: Расширенные

# label5.Text
source: Pass
ru: Пароль

# label4.Text
source: Login
ru: Логин

# label2.Text
source: IP addr
ru: IP адрес

# SwitchName.HeaderText
source: Name
ru: Название

# SwitchDescription.HeaderText
source: Description
ru: Описание

# dataGridOutputSwitch.ToolTip
source: Aviosys IP9212 has different predefined statuses: OUT1 - OUT4: Normally closed relay (NС) OUT5 - OUT8: Normally opened relay (NO) This cannot be changed
ru: В блоке управления питанием Aviosys IP9212 разные порты настроены по разному: OUT1 - OUT4: Нормально замкнутые (NC) OUT5 - OUT8: Нормально разомкнутые (NO) Это фабричная настройка и она не может быть изменена.

# groupBox2.Text
source: Output switch settings
ru: Настройки датчиков управления питанием

# ipaddr.ToolTip
source: IP addres of the device. Use "ipEdit.exe" to locate its IP addres
ru: IP адрес устройства. Если неизвестен, то можно воспользоваться прилагающиейся утилитой "ipEdit.exe" для обнаружения устройства

# login.ToolTip
source: Login name. Factory default for the device is "admin"
ru: Имя пользователя для входа в устройства. Значение по умолчанию из коробки "admin"

# pass.ToolTip
source: Device password. Factory default for the device is "12345678"
ru: Пароль для входа в устройство. По умолчанию из коробки "12345678"

# groupBox1.Text
source: IP9212 settings
ru: Настройки IP9212

# InputSwitchName.HeaderText
source: Name
ru: Название

# InputSwitchDescription.HeaderText
source: Description
ru: Описание

# dataGridInputSwitch.ToolTip
source: Aviosys IP9212 has two types of input settings: IN 1 - IN 4: Voltage input ON: 4V~24V OFF: 0V~ 3V IN 5 - IN 8: Resistant input ON: 0ohm ~ 200 ohm OFF: 500ohm ~ ∞ They are marked with "V" and "R" sign respectively
ru: В модуле датчиков Aviosys IP9212 предусмотрены два типа датчиков: IN 1 - IN 4: датчики по величине напряжения ON: 4V~24V OFF: 0V~ 3V IN 5 - IN 8: датчики по величине сопротивления ON: 0 Ом ~ 200 Ом OFF: 500 Ом ~ ∞ В таблице порты отмечены знаками "V" и "R", соответственно

# groupBox4.Text
source: Input switch settings
ru: Настройки датчиков

# groupBox5.Text
source: About
ru: О драйвере

# $this.Text
source: ASCOM Aviosys IP9212 Switch Driver Setup
ru: Настройки драйвера сервера питания Aviosys IP9212 (ASCOM Switch driver)
